In [1]:
import pandas as pd
import numpy as np

In [13]:
data=pd.read_excel('D:/Téléchargements/example_data_cleaning.xlsx')

In [14]:
data.head()

   TransactionID  ClientID  BirthYear  Amount Profession  Department    Risk
0              1     34982     2013.0   12900    Student          78     Low
1              2     34983     2015.0    1230     barmen          78    High
2              3     34984     1945.0    3450    student          78  Medium
3              4     34985     1923.0    5670    manager          78     Low
4              5     34986     1978.0    7890         hr          78    High

In [5]:
data.shape

(30, 7)

In [6]:
data.describe()

       TransactionID      ClientID    BirthYear        Amount  Department
count      30.000000     30.000000    28.000000  3.000000e+01        30.0
mean       15.500000  34993.833333  1968.316327  1.010097e+05        78.0
std         8.803408      8.132876    27.963867  4.342616e+05         0.0
min         1.000000  34982.000000  1923.000000  1.230000e+03        78.0
25%         8.250000  34987.250000  1944.714286  1.233000e+04        78.0
50%        15.500000  34991.500000  1967.000000  1.899000e+04        78.0
75%        22.750000  34999.750000  1988.000000  2.953500e+04        78.0
max        30.000000  35008.000000  2017.000000  2.399090e+06        78.0

In [7]:
data.dtypes

TransactionID      int64
ClientID           int64
BirthYear        float64
Amount             int64
Profession        object
Department         int64
Risk              object
dtype: object

In [8]:
data.isna().sum()

TransactionID    0
ClientID         0
BirthYear        2
Amount           0
Profession       2
Department       0
Risk             0
dtype: int64

In [15]:
data=data.dropna()

In [16]:
type(data)

pandas.core.frame.DataFrame

In [17]:
data.isna().sum()

TransactionID    0
ClientID         0
BirthYear        0
Amount           0
Profession       0
Department       0
Risk             0
dtype: int64

In [21]:
data[data['BirthYear']==2017]

    TransactionID  ClientID  BirthYear  Amount Profession  Department    Risk
17             13     34994     2017.0   25650     Driver          78  Medium

In [31]:
data['Amount'].max()

2399090

In [32]:
data=data.drop(index=19,axis=0)

In [23]:
data=data.drop(index=17,axis=0)

In [24]:
type(data)

pandas.core.frame.DataFrame

In [26]:
data.drop(columns="Department", inplace=True)

In [28]:
data.drop(columns="TransactionID", inplace=True)

In [33]:
data

    ClientID    BirthYear  Amount  Profession  Risk
0      34982  2013.000000   12900           4     1
1      34983  2015.000000    1230           5     0
2      34984  1945.000000    3450          13     2
3      34985  1923.000000    5670          10     1
4      34986  1978.000000    7890           9     0
5      34987  1967.000000   10110           3     2
6      34987  1967.000000   30090           3     1
9      34988  1999.000000   25650           3     1
10     34989  1958.000000   14550           1     0
11     34989  1967.000000   27870           1     2
12     34990  1953.285714   16770           3     2
13     34991  1988.000000   18990           0     1
14     34991  1988.000000   55250           0     0
15     34992  1943.857143   21210          12     2
16     34993  1939.142857   23430          11     1
18     34995  1999.000000   27870           2     1
20     34998  1978.000000    7890           8     2
21     34999  1988.000000   10110           8     1
22     35000  1948.571429   12330           5     0
23     35001  1943.857143   14550          13     2
24     35002  1939.142857   16770          10     1
25     35006  1923.000000   33050           1     0
26     35007  1999.000000   37490           8     2
27     35008  1967.000000   41930           6     1

In [30]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
data['Profession']=encoder.fit_transform(data['Profession'])
data['Risk']=encoder.fit_transform(data['Risk'])